Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/ddns.c
/*******************************************************************************
  Company:
    Microchip Technology Inc.

  File Name:
    ddns.c

  Summary:
    DNS Update API Version 2.0.3 (www.dyndns.com)

  Description:
    Dynamic DNS Client Module

 *******************************************************************************/

//DOM-IGNORE-BEGIN
/*******************************************************************************
Copyright (c) <2014> released Microchip Technology Inc.  All rights reserved.

 * Confirmed By jinzhouyun, Date 2016.10.01
 *******************************************************************************/
//DOM-IGNORE-END

#ifndef __DYNDNSCLIENT_C_
#define __DYNDNSCLIENT_C_

#include <xc.h>
#include "tcpip/tcpip.h"

#if defined STACK_USE_DYNAMICDNS_CLIENT

// Delimiter to locate IP address from CheckIP server
static ROM uint8_t _checkIpSrvrResponse[] = "Address:";

// Response codes from DynDNS Update Server
static ROM char * _updateIpSrvrResponse[] = {
    /* 0 */ "good", // Update was successful
    /* 1 */ "nochg", // No change was made; request is considered abusive
    /* 2 */ "abuse", // Account has been blocked for abuse
    /* 3 */ "badsys", // System is not supported
    /* 4 */ "badagent", // Agent has been blocked for abuse
    /* 5 */ "badauth", // Authentication failed
    /* 6 */ "!donator", // A paid account feature was requested on a free account
    /* 7 */ "notfqdn", // Hostname was not a fully-qualified domain name
    /* 8 */ "nohost", // Host name was not found in the system
    /* 9 */ "!yours", // The specified hostname does not belong to this account
    /* 10 */ "numhost", // Number of hosts does not match / serious error
    /* 11 */ "dnserr", // System error was encountered, try again soon
    /* 12 */ "911", // System error was encountered, try again later
};

/****************************************************************************
  Section:
    Dynamic DNS Services
    These services must support the DynDNS API, and correspond to
    DDNS_SERVICES enumeration
 ***************************************************************************/

// Host names for various Dynamic DNS services
ROM char * ROM ddnsServiceHosts[] = {
    "members.dyndns.org", // DYNDNS_ORG
    "dynupdate.no-ip.com", // NO_IP_COM
    "updates.dnsomatic.com", // DNSOMATIC_COM
};

// Port numbers for various Dynamic DNS services
static ROM uint16_t ddnsServicePorts[] = {
    80, // DYNDNS_ORG
    80, // NO_IP_COM
    80, // DNSOMATIC_COM
};

/****************************************************************************
  Section:
    Global Variables
 ***************************************************************************/
static IP_ADDR lastKnownIP; // Last known IP address of this device
static DDNS_STATUS lastStatus; // Status response from last update

DDNS_POINTERS DDNSClient; // Configuration parameters for the module

static uint32_t dwUpdateAt; // Indicates when the next CheckIP should be done
static bool bForceUpdate; // Indicates that the update should be done regardless
// of whether or not the IP changed.  Use this flag
// when the user/pass/hostname have changed.

/****************************************************************************
  Function:
    void DDNSInit(void)

  Summary:
    Initializes the Dynamic DNS module.

  Description:
    This function initializes the Dynamic DNS client.  It clears the
    DDNSClient pointers structure, and tells the module to attempt the
    first update after 15 seconds have elapsed (so as to allow the DHCP
    configuration to stabalize).

  Precondition:
    None

  Parameters:
    None

  Returns:
    None

  Remarks:
    This function is called only one during lifetime of the application.
 ***************************************************************************/
void DDNSInit(void)
{
    // Clear the Dynamic DNS Client to start
    memset((void *) &DDNSClient, 0x00, sizeof (DDNSClient));

    // Use the default Check IP server
    DDNSClient.ROMPointers.CheckIPServer = 1;
    DDNSClient.CheckIPServer.szROM = DDNS_CHECKIP_SERVER;
    DDNSClient.CheckIPPort = DDNS_DEFAULT_PORT;

    // First update is 15 seconds after boot, allowing DHCP to stabilize
    dwUpdateAt = TickGet() + 15 * TICK_SECOND;
    bForceUpdate = true;
    lastStatus = DDNS_STATUS_UNKNOWN;
}

/****************************************************************************
  Function:
    void DDNSTask(void)

  Summary:
    Dynamic DNS client task/state machine.

  Description:
    This function performs the background tasks of the Dynamic DNS Client.
    Once the DDNSPointers structure is configured, this task attempt to
    update the Dynamic DNS hostname on a periodic schedule.

    The task first accesses the CheckIP server to determine the device's
    current external IP address.  If the IP address has changed, it
    issues an update command to the dynamic DNS service to propagate the
    change.  This sequence executes whenever dwUpdateAt elapses, which by
    default is every 10 minutes, or when an update is forced.

  Precondition:
    DDNSInit() has been called.

  Parameters:
    None

  Returns:
    None

  Remarks:
    This function acts as a task (similar to one in an RTOS).  It
    performs its task in a co-operative manner, and the main application
    must call this function periodically to ensure that its tasks get
    executed in a timely fashion.
 ***************************************************************************/
void DDNSTask(void)
{
    uint8_t i;
    static uint32_t Timer;
    static TCP_SOCKET MySocket = INVALID_SOCKET;
    static char ROM *ROMStrPtr;
    static char *RAMStrPtr;

    static uint8_t vBuffer[16];
    uint16_t wPos;
    static IP_ADDR ipParsed;

    static enum {
        SM_IDLE = 0u,
        SM_BEGIN_CHECKIP, // 0x1
        SM_CHECKIP_SKT_OBTAINED, // 0x2
        SM_CHECKIP_FIND_DELIMITER, // 0x3
        SM_CHECKIP_FIND_ADDRESS, // 0x4
        SM_CHECKIP_DISCONNECT, // 0x5
        SM_IP_UPDATE_HOME, // 0x6
        SM_IP_UPDATE_SKT_OBTAINED, // 0x7

