Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/ddns.c
        /*
         * HTTP request msg is divided into 6 parts
         * SM_IP_UPDATE_REQ_A,B,C,D,E,F as the tcp ip tx
         * buffer is only able to carry 200 bytes at a time.
         */

        SM_IP_UPDATE_REQ_A, // 0x8
        SM_IP_UPDATE_REQ_B, // 0x9
        SM_IP_UPDATE_REQ_C, // 0xa
        SM_IP_UPDATE_REQ_D, // 0xb
        SM_IP_UPDATE_REQ_E, // 0xc
        SM_IP_UPDATE_REQ_F, // 0xd

        SM_IPUPDATE_FIND_RESPONSE, // 0xe
        SM_IPUPDATE_PARSE_RESPONSE, // 0xf
        SM_IPUDATE_DISCONNECT, // 0x10
        SM_DONE, // Done, try again in 10 minutes
        SM_SOFT_ERROR, // Soft error, try again in 30 seconds
        SM_SYSTEM_ERROR // System error, try again in 30 minutes
    } smDDNS = SM_IDLE;

    switch (smDDNS) {
    case SM_IDLE:

        // Wait for timeout to begin IP check
        if ((int32_t) (TickGet() - dwUpdateAt) < 0)
            break;

        // Otherwise, continue to next state
        smDDNS = SM_BEGIN_CHECKIP;

    case SM_BEGIN_CHECKIP:

        // If a fatal error has occurred, abort to the SM_DONE state and keep
        // the error message.
        if (lastStatus >= DDNS_STATUS_ABUSE && lastStatus <= DDNS_STATUS_911) {
            smDDNS = SM_DONE;
            break;
        }

        // If DDNSClient is not properly configured, abort
        if ( // Verify that each pointer is not null, and is not empty
            (DDNSClient.ROMPointers.Host && (!DDNSClient.Host.szROM || *DDNSClient.Host.szROM == '\0')) ||
            (!DDNSClient.ROMPointers.Host && (!DDNSClient.Host.szRAM || *DDNSClient.Host.szRAM == '\0')) ||
            (DDNSClient.ROMPointers.Username && (!DDNSClient.Username.szROM || *DDNSClient.Username.szROM == '\0')) ||
            (!DDNSClient.ROMPointers.Username && (!DDNSClient.Username.szRAM || *DDNSClient.Username.szRAM == '\0')) ||
            (DDNSClient.ROMPointers.Password && (!DDNSClient.Password.szROM || *DDNSClient.Password.szROM == '\0')) ||
            (!DDNSClient.ROMPointers.Password && (!DDNSClient.Password.szRAM || *DDNSClient.Password.szRAM == '\0')) ||
            (DDNSClient.ROMPointers.CheckIPServer && (!DDNSClient.CheckIPServer.szROM || *DDNSClient.CheckIPServer.szROM == '\0')) ||
            (!DDNSClient.ROMPointers.CheckIPServer && (!DDNSClient.CheckIPServer.szRAM || *DDNSClient.CheckIPServer.szRAM == '\0')) ||
            (DDNSClient.ROMPointers.UpdateServer && (!DDNSClient.UpdateServer.szROM || *DDNSClient.UpdateServer.szROM == '\0')) ||
            (!DDNSClient.ROMPointers.UpdateServer && (!DDNSClient.UpdateServer.szRAM || *DDNSClient.UpdateServer.szRAM == '\0'))
        ) {
            smDDNS = SM_SOFT_ERROR;
            lastStatus = DDNS_STATUS_INVALID;
            break;
        }

        // Start with an invalidated IP String
        vBuffer[0] = '\0';

        // Connect a socket to the remote server
        if (DDNSClient.ROMPointers.CheckIPServer) {
            MySocket = TCPOpen((uint32_t) (ROM_PTR_BASE) DDNSClient.CheckIPServer.szROM, TCP_OPEN_ROM_HOST,
                    DDNSClient.CheckIPPort, TCP_PURPOSE_DEFAULT);
        } else {
            MySocket = TCPOpen((uint32_t) (PTR_BASE) DDNSClient.CheckIPServer.szRAM, TCP_OPEN_RAM_HOST,
                    DDNSClient.CheckIPPort, TCP_PURPOSE_DEFAULT);
        }

        // If no socket available, try again on next loop
        if (MySocket == INVALID_SOCKET)
            break;

        smDDNS++;
        Timer = TickGet();
        break;

    case SM_CHECKIP_SKT_OBTAINED:

        // Wait for the remote server to accept our connection request
        if (!TCPIsConnected(MySocket)) {
            // Time out if too much time is spent in this state
            if (TickGet() - Timer > 6 * TICK_SECOND) {
                // Close the socket so it can be used by other modules
                // We will retry soon
                TCPDisconnect(MySocket);
                MySocket = INVALID_SOCKET;
                lastStatus = DDNS_STATUS_CHECKIP_ERROR;
                smDDNS = SM_SOFT_ERROR;
            }
            break;
        }

        Timer = TickGet();

        // Make certain the socket can be written to
        if (TCPIsPutReady(MySocket) < 125u)//125 = size of TCP Tx buffer
            break;

        // Transmit the request to the server
        TCPPutROMString(MySocket, (ROM uint8_t *) "GET / HTTP/1.0\r\nHost: ");

        if (DDNSClient.ROMPointers.CheckIPServer) {
            TCPPutROMString(MySocket, DDNSClient.CheckIPServer.szROM);
        } else {
            TCPPutString(MySocket, DDNSClient.CheckIPServer.szRAM);
        }

        TCPPutROMString(MySocket, (ROM uint8_t *) "\r\nConnection: close\r\n\r\n");

        // Send the packet
        TCPFlush(MySocket);
        smDDNS++;
        break;

    case SM_CHECKIP_FIND_DELIMITER:

        // Check if remote node is still connected.  If not, force to the disconnect state,
        // but don't break because data may still be waiting.
        if (!TCPIsConnected(MySocket) || TickGet() - Timer > 6 * TICK_SECOND)
            smDDNS = SM_CHECKIP_DISCONNECT;

        // Search out the "Address: " delimiter in the response
        wPos = TCPFindROMArray(MySocket, (ROM uint8_t *) "Address: ", 9, 0, false);

        // If not yet found, clear as much as possible and break
        if (wPos == 0xffff) {
            wPos = TCPIsGetReady(MySocket);
            if (wPos > 9u)
                TCPGetArray(MySocket, NULL, wPos - 9);
            break;
        }

        // Clear up to and past that string
        TCPGetArray(MySocket, NULL, wPos + 9);

        // Continue on to read the IP
        Timer = TickGet();
        smDDNS++;

    case SM_CHECKIP_FIND_ADDRESS:

        // Check if remote node is still connected.  If not, force to the disconnect state,
        // but don't break because data may still be waiting.
        if (!TCPIsConnected(MySocket) || TickGet() - Timer > 6 * TICK_SECOND)
            smDDNS = SM_CHECKIP_DISCONNECT;

        // Search out the "</body>" delimiter in the response
        wPos = TCPFindROMArray(MySocket, (ROM uint8_t *) "</body>", 7, 0, false);

        // If not yet found, break
        if (wPos == 0xffff)
            break;

        // Read and terminate that string as the IP address (preventing buffer overflows)
        if (wPos > 15u)
            wPos = 15;
        TCPGetArray(MySocket, vBuffer, wPos);
        vBuffer[wPos] = '\0';

        // Parse the IP address that was read, invalidating on failure
        if (!StringToIPAddress(vBuffer, &ipParsed))
            vBuffer[0] = '\0';

        // Continue on to close the socket

    case SM_CHECKIP_DISCONNECT:

        // Close the socket
        TCPDisconnect(MySocket);
        MySocket = INVALID_SOCKET;

        // Determine if an update is necessary
        if (vBuffer[0] == '\0') { // CheckIP Failed
            lastStatus = DDNS_STATUS_CHECKIP_ERROR;
            smDDNS = SM_SOFT_ERROR;
            break;
        }

        if ((ipParsed.Val == lastKnownIP.Val) && (!bForceUpdate)) {
            // IP address has not changed and no update is forced
            lastStatus = DDNS_STATUS_UNCHANGED;
            smDDNS = SM_DONE;
            break;
        }

