Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/ddns.c
        // Need to perform an update
        lastKnownIP = ipParsed;
        bForceUpdate = false;
        smDDNS++;
        break;

    case SM_IP_UPDATE_HOME:

        // Connect a socket to the remote server
        if (DDNSClient.ROMPointers.UpdateServer) {
            MySocket = TCPOpen((uint32_t) (ROM_PTR_BASE) DDNSClient.UpdateServer.szROM, TCP_OPEN_ROM_HOST,
                    DDNSClient.UpdatePort, TCP_PURPOSE_DEFAULT);
        } else {
            MySocket = TCPOpen((uint32_t) (PTR_BASE) DDNSClient.UpdateServer.szRAM, TCP_OPEN_RAM_HOST,
                    DDNSClient.UpdatePort, TCP_PURPOSE_DEFAULT);
        }

        // If no socket is available, try again on the next loop
        if (MySocket == INVALID_SOCKET)
            break;

        // Move on to the next state
        smDDNS++;
        Timer = TickGet();
        break;

    case SM_IP_UPDATE_SKT_OBTAINED:

        // Wait for the remote server to accept our connection request
        if (!TCPIsConnected(MySocket)) {
            // Time out if too much time is spent in this state
            if (TickGet() - Timer > 6 * TICK_SECOND) {
                // Close the socket so it can be used by other modules
                // We will try again immediately
                TCPDisconnect(MySocket);
                MySocket = INVALID_SOCKET;
                lastStatus = DDNS_STATUS_UPDATE_ERROR;
                smDDNS--;
            }
            break;
        }

        // Reset timer and begin sending the request
        Timer = TickGet();
        smDDNS++;
        // No break needed...try to send first bit immediately.

    case SM_IP_UPDATE_REQ_A:

        // Check for lost connections or timeouts
        if (!TCPIsConnected(MySocket) || (TickGet() - Timer > 10 * TICK_SECOND)) {
            lastStatus = DDNS_STATUS_UPDATE_ERROR;
            smDDNS = SM_IPUDATE_DISCONNECT;
            break;
        }

        if (TCPIsPutReady(MySocket) < 25u) // 25 =~ 16+9
            break;

        TCPPutROMString(MySocket, (ROM uint8_t *) "GET /nic/update?hostname=");
        smDDNS++;
        // No break needed...try to send next bit immediately.

    case SM_IP_UPDATE_REQ_B:

        // Check for lost connections or timeouts
        if (!TCPIsConnected(MySocket) || (TickGet() - Timer > 10 * TICK_SECOND)) {
            lastStatus = DDNS_STATUS_UPDATE_ERROR;
            smDDNS = SM_IPUDATE_DISCONNECT;
            break;
        }

        // Try to write, verifying that space is available first
        if (DDNSClient.ROMPointers.Host) {
            if (TCPIsPutReady(MySocket) < strlenpgm((ROM char *) DDNSClient.Host.szROM))
                break;
            TCPPutROMString(MySocket, DDNSClient.Host.szROM);
        } else {
            if (TCPIsPutReady(MySocket) < strlen((char *) DDNSClient.Host.szRAM))
                break;
            TCPPutString(MySocket, DDNSClient.Host.szRAM);
        }

        smDDNS++;
        // No break needed...try to send next bit immediately.

    case SM_IP_UPDATE_REQ_C:

        // Check for lost connections or timeouts
        if (!TCPIsConnected(MySocket) || TickGet() - Timer > 10 * TICK_SECOND) {
            lastStatus = DDNS_STATUS_UPDATE_ERROR;
            smDDNS = SM_IPUDATE_DISCONNECT;
            break;
        }

        if (TCPIsPutReady(MySocket) < 70u)
            break;

        TCPPutROMString(MySocket, (ROM uint8_t *) "&myip=");
        TCPPutString(MySocket, vBuffer);
        TCPPutROMString(MySocket, (ROM uint8_t *) "&wildcard=NOCHG&mx=NOCHG&backmx=NOCHG HTTP/1.0");

        TCPFlush(MySocket);
        smDDNS++;
        // No break needed...try to send next bit immediately.

    case SM_IP_UPDATE_REQ_D:

        // Check for lost connections or timeouts
        if (!TCPIsConnected(MySocket) || TickGet() - Timer > 10 * TICK_SECOND) {
            lastStatus = DDNS_STATUS_UPDATE_ERROR;
            smDDNS = SM_IPUDATE_DISCONNECT;
            break;
        }

        if (TCPIsPutReady(MySocket) < 131u) // 131 =~ 8+23 + dynamic dns server hostname
            break;

        TCPPutROMString(MySocket, (ROM uint8_t *) "\r\nHost: "); // 8

        if (DDNSClient.ROMPointers.UpdateServer)
            TCPPutROMString(MySocket, DDNSClient.UpdateServer.szROM);
        else
            TCPPutString(MySocket, DDNSClient.UpdateServer.szRAM);

        TCPPutROMString(MySocket, (ROM uint8_t *) "\r\nAuthorization: Basic "); // 23

        TCPFlush(MySocket);
        smDDNS++;
        // No break needed...try to send the next bit immediately.

    case SM_IP_UPDATE_REQ_E:

        // Check for lost connections or timeouts
        if (!TCPIsConnected(MySocket) || TickGet() - Timer > 6 * TICK_SECOND) {
            lastStatus = DDNS_STATUS_UPDATE_ERROR;
            smDDNS = SM_IPUDATE_DISCONNECT;
            break;
        }

        // User name and passwords for DynDNS.org can each be up to 24 characters
        // Base64 encoded data is always at least 25% bigger than the original
        if (TCPIsPutReady(MySocket) < 100u)
            break;

        if (DDNSClient.ROMPointers.Username) {
            ROMStrPtr = (ROM char *) DDNSClient.Username.szROM;
            wPos = strlenpgm(ROMStrPtr);
        } else {
            RAMStrPtr = (char *) DDNSClient.Username.szRAM;
            wPos = strlen((char *) RAMStrPtr);
        }

        i = 0;
        while (wPos) {
            while (i < wPos && i < 3u) {
                if (DDNSClient.ROMPointers.Username)
                    vBuffer[i] = *ROMStrPtr++;
                else
                    vBuffer[i] = *RAMStrPtr++;
                i++;
            }
            wPos -= i;

            if (i == 3u) {
                Base64Encode(vBuffer, i, vBuffer, 4);
                TCPPutArray(MySocket, vBuffer, 4);
                i = 0;
            }
        }

        if (DDNSClient.ROMPointers.Password) {
            ROMStrPtr = (ROM char *) DDNSClient.Password.szROM;
            wPos = strlenpgm(ROMStrPtr);
        } else {
            RAMStrPtr = (char *) DDNSClient.Password.szRAM;
            wPos = strlen((char *) RAMStrPtr);
        }

        // Increment for the ':' separator and i for bytes left in username
        wPos += i + 1;

        vBuffer[i++] = ':';

        while (wPos) {
            while (i < wPos && i < 3u) {
                if (DDNSClient.ROMPointers.Password)
                    vBuffer[i] = *ROMStrPtr++;
                else
                    vBuffer[i] = *RAMStrPtr++;
                i++;
            }
            wPos -= i;
            Base64Encode(vBuffer, i, vBuffer, 4);
            TCPPutArray(MySocket, vBuffer, 4);
            i = 0;
        }

        TCPFlush(MySocket);
        smDDNS++;
        break;

    case SM_IP_UPDATE_REQ_F:

        // Check for lost connections or timeouts
        if (!TCPIsConnected(MySocket) || TickGet() - Timer > 10 * TICK_SECOND) {
            lastStatus = DDNS_STATUS_UPDATE_ERROR;
            smDDNS = SM_IPUDATE_DISCONNECT;
            break;
        }

        if (TCPIsPutReady(MySocket) < 50u)
            break;

        TCPPutROMString(MySocket, (ROM uint8_t *) "\r\nUser-Agent: Microchip - TCPIPSTACK - "TCPIP_STACK_VERSION"\r\n\r\n");
        TCPFlush(MySocket);
        smDDNS++;

