Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/ddns.c
        // Reset the timer to wait for a response
        Timer = TickGet();
        break;

    case SM_IPUPDATE_FIND_RESPONSE:
        // Locate the response string

        // Wait up to 10 seconds for a response
        if (TickGet() - Timer > 10 * TICK_SECOND) {
            lastStatus = DDNS_STATUS_UPDATE_ERROR;
            smDDNS = SM_IPUDATE_DISCONNECT;
            break;
        }

        // According to HTTP, the response will start after the two CRLFs
        wPos = TCPFindROMArray(MySocket, (ROM uint8_t *) "\r\n\r\n", 4, 0, false);

        // If not yet found, eliminate everything up to
        if (wPos == 0xffff) {
            wPos = TCPIsGetReady(MySocket);
            if (wPos > 4u)
                TCPGetArray(MySocket, NULL, wPos - 4);
            break;
        }

        TCPGetArray(MySocket, NULL, wPos + 4);
        smDDNS++;
        // No break...continue to next state immediately

    case SM_IPUPDATE_PARSE_RESPONSE:
        // Try to parse the response text

        // Wait up to 10 seconds for the remote server to disconnect
        // so we know all data has been received
        if (TCPIsConnected(MySocket) && TickGet() - Timer < 10 * TICK_SECOND)
            break;

        // Read the response code
        wPos = TCPIsGetReady(MySocket);
        if (wPos > sizeof (vBuffer) - 1)
            wPos = sizeof (vBuffer) - 1;

        wPos = TCPGetArray(MySocket, vBuffer, wPos);
        vBuffer[wPos] = '\0';
        for (i = 0; i < sizeof (vBuffer); i++)
            if (vBuffer[i] == ' ')
                vBuffer[i] = '\0';

        for (lastStatus = 0; lastStatus <= DDNS_STATUS_UPDATE_ERROR; lastStatus++)
            if (!strcmppgm2ram((char *) vBuffer, (ROM char *) _updateIpSrvrResponse[lastStatus]))
                break;

        smDDNS++;
        // No break...continue to finalization

    case SM_IPUDATE_DISCONNECT:
        // Close the socket so it can be used by other modules.
        if (MySocket != INVALID_SOCKET) {
            TCPDisconnect(MySocket);
            MySocket = INVALID_SOCKET;
        }

        // Determine what to do based on status
        if (lastStatus <= DDNS_STATUS_NUMHOST || lastStatus == DDNS_STATUS_UNCHANGED)
            smDDNS = SM_DONE;
        else if (lastStatus == DDNS_STATUS_911 || lastStatus == DDNS_STATUS_DNSERR)
            smDDNS = SM_SYSTEM_ERROR;
        else
            smDDNS = SM_SOFT_ERROR;

        smDDNS++;
        break;

    case SM_DONE:
        dwUpdateAt = TickGet() + 10 * 60 * TICK_SECOND; // 10 minutes
        smDDNS = SM_IDLE;
        break;

    case SM_SOFT_ERROR:
        dwUpdateAt = TickGet() + 30 * TICK_SECOND; // 30 seconds
        smDDNS = SM_IDLE;
        break;

    case SM_SYSTEM_ERROR:
        dwUpdateAt = TickGet() + 30 * 60 * TICK_SECOND; // 30 minutes
        smDDNS = SM_IDLE;
        break;
    }
}

/*****************************************************************************
  Function:
    void DDNSForceUpdate(void)

  Summary:
    Forces an immediate DDNS update

  Description:
    This function forces the DDNS Client to execute a full update
    immediately.  Any error message is cleared, and the update will be
    executed whether the IP address has changed or not.  Call this
    function every time the DDNSClient parameters have been modified.

  Precondition:
    DDNSInit must have been called.

  Parameters:
    None

  Returns:
    None
 ***************************************************************************/
void DDNSForceUpdate(void)
{
    // Force update on next DDNSClient call
    dwUpdateAt = TickGet();
    bForceUpdate = true;
    lastStatus = DDNS_STATUS_UNKNOWN;
}

/*****************************************************************************
  Function:
    void DDNSSetService(DDNS_SERVICES svc)

  Summary:
    Selects a pre-configured Dynamic DNS service

  Description:
    This function selects a Dynamic DNS service based on parameters
    configured in ddnsServiceHosts and ddnsServicePorts.  These arrays
    must match the DDNS_SERVICES enumeration.

  Precondition:
    None

  Parameters:
    svc - one of the DDNS_SERVICES elements to indicate the selected service

  Returns:
    None
 ***************************************************************************/
void DDNSSetService(DDNS_SERVICES svc)
{
    DDNSClient.ROMPointers.UpdateServer = 1;
    DDNSClient.UpdateServer.szROM = (ROM uint8_t *) ddnsServiceHosts[svc];
    DDNSClient.UpdatePort = ddnsServicePorts[svc];
}

/*****************************************************************************
  Function:
    IP_ADDR DDNSGetLastIP(void)

  Summary:
    Returns the last known external IP address of the device.

  Description:
    This function returns the last known external IP address of the device.

 Precondition:
    None

  Parameters:
    None

  Returns:
    The last known external IP address of the device.
 ***************************************************************************/
IP_ADDR DDNSGetLastIP(void)
{
    return lastKnownIP;
}

/*****************************************************************************
  Function:
    DDNS_STATUS DDNSGetLastStatus(void)

  Summary:
    Returns the status of the most recent update.

  Description:
    This function returns the status of the most recent update.  See the
    DDNS_STATUS enumeration for possible codes.

  Precondition:
    None

  Parameters:
    None

  Returns:
    DDNS_STATUS indicating the status code for the most recent update.
 ***************************************************************************/

DDNS_STATUS DDNSGetLastStatus(void)
{
    return lastStatus;
}

#endif // STACK_USE_DYNAMICDNS_CLIENT

#endif // __DYNDNSCLIENT_C_
